app/controllers/posts_controller.rb

UPDATE "posts" SET "simple_response" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["simple_response", "UNLIKELY"], ["updated_at", "2019-04-08 20:46:48.146308"], ["id", 19]]
---
          })
        end

        @post.update(face_detection_response: face_annotations.to_json)

INSERT INTO "posts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-04-07 18:00:06.661114"], ["updated_at", "2019-04-07 18:00:06.661114"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save